#language:ru

@cucumber
Функция: Демонстрация возможностей core

  Сценарий: Проверка циклошагов
    И установить переменные:
      | value | 1 |
    И начало цепочки шагов с 5 попытками с интервалом 10 мс
    И установить переменные:
      | value | ${{value}}_1 |
    И переменные имеют значения:
      | value | == | 1_1_1_1_1_1 |
    И конец цепочки шагов

  Сценарий: Проверка сравнения и извлечения значений из XML
    Дано установить переменные:
      | xmlVariable | ${{file:data/demo/xml/test2.xml}} |
    И получить переменные из XML строки '${{xmlVariable}}' по XPath:
      | to | //to |
    Тогда переменные имеют значения:
      | to | == | Tove |

  Сценарий: Проверка сравнения и извлечения значений массива xml по родительской Node
    Дано установить переменные:
      | xmlVariable2 | ${{file:data/demo/xml/testArray.xml}} |
    И получить переменные из XML строки '${{xmlVariable2}}' по XPath:
      | arrayString | //string-array[1] |
    Тогда переменные имеют значения:
      | arrayString | contains | Berlin  |
      | arrayString | contains | Vienna  |
      | arrayString | contains | Denmark |

  Сценарий: Проверка сравнения и извлечения значений массива xml отдельные node с поиском
    Дано установить переменные:
      | xmlVariable2 | ${{file:data/demo/xml/testArray2.xml}} |
    И получить переменные из XML строки '${{xmlVariable2}}' по XPath:
      | arrayMaleDelimiter | /students/student[gender='Male']/name |
    Тогда переменные имеют значения:
      | arrayMaleDelimiter | == | Jimmy; Manju |

    И получить переменные из XML строки '${{xmlVariable2}}' по XPath:
      | arrayFemale | /students/student[gender='Female']/name |
    Тогда переменные имеют значения:
      | arrayFemale | == | Darla |

  Сценарий: Работа с переменными содержащими null
    И установить переменные:
      | name | ${{null}} |
    И установить переменные:
      | nameNull | ${{name}} |
    И переменные имеют значения:
      | nameNull | isNull |  |
    И установить переменные:
      | nameNullConcat | 123${{name}}456${{nameNull}} |
    И переменные имеют значения:
      | nameNullConcat | == | 123null456null |

  Сценарий: nullResolve
    И установить переменные:
      | var  | 123      |
    И установить переменные:
      | var1 | ${{var}} |
    И переменные имеют значения:
      | var1 | == | 123 |

  Сценарий: вложенные функции контекста
    И установить переменные:
      | name | ОАО "Рога и копыта"   |
      | var1 | ${{escape:${{name}}}} |
    И переменные имеют значения:
      | var1 | == | ОАО \"Рога и копыта\" |

  Сценарий: вложенные функции в функции
    И установить переменные:
      | text    | Hello, world!                                   |
      | encoder | ${{base64Encoder:${{text}}}}                    |
      | decoder | ${{base64Decoder:${{base64Encoder:${{text}}}}}} |
    И переменные имеют значения:
      | encoder | == | SGVsbG8sIHdvcmxkIQ== |
      | decoder | == | Hello, world!        |

  Сценарий: Проверка сравнения чисел 1
    И установить переменные:
      | value1 | 1 |
      | value2 | 2 |
    И переменные имеют значения:
      | value1 | < | ${{value2}} |

  Сценарий: Проверка сравнения чисел 2
    И установить переменные:
      | value1 | 1.01 |
      | value2 | 1.02 |
    И переменные имеют значения:
      | value1 | < | ${{value2}} |

  Сценарий: Проверка сравнения чисел 3
    И установить переменные:
      | value1 | 0 |
      | value2 | -0.0000001 |
    И переменные имеют значения:
      | value1 | > | ${{value2}} |

  Сценарий: Проверка сравнения чисел 3
    И установить переменные:
      | value1 | 2 |
      | value2 | 2 |
      | value3 | 3 |
    И переменные имеют значения:
      | value1 | <= | ${{value2}} |
    И переменные имеют значения:
      | value1 | <= | ${{value3}} |

  Сценарий: Проверка FakerRU
    И установить переменные:
      | param2 | ${{fakerRu:ogrn}}  |

  #@Skip
  #Сценарий: Проверка jsMathExecutor
  #  И установить переменные:
  #    | param1 | ${{calc:(5+12)/2&%.1f}}|
  #  И установить переменные:
  #    | value | ${{calc:(${{param1}}+12)/2&%.1f}}|