#language:ru
@active
@webElemTesting
Функционал: проверка активности элементов
  
  Сценарий: проверка что элемент активен
    И открыть ссылку '${{url.form}}'
    И перейти на страницу 'Тестовая Форма'
    И проверить, что элемент 'Отправка' активен
  
  Сценарий: проверка что различные элементы активны
    И открыть ссылку '${{url.form}}'
    И перейти на страницу 'Тестовая Форма'
    И проверить, что элементы активны :
      | Отмена      |
      | Отправка    |
      | Комментарий |
      | Логин       |
      | Чекбокс 1   |