#language:ru
@check_attributes
@webElemTesting
Функционал: Проверка атрибутов

  Сценарий: наличие атрибута
    И открыть ссылку '${{url.buttons}}'
    И перейти на страницу 'Форма с кнопками'
    И проверить у элемента 'OnBlur' наличие атрибута 'onBlur'

  Сценарий: проверка атрибутов
    И открыть ссылку '${{url.buttons}}'
    И перейти на страницу 'Форма с кнопками'
    И проверить у элемента 'OnBlur' значения атрибутов:
      | onblur | != | true                 |
      | onblur | == | triggeredEvent(this) |