#language:ru
@click_testing
@webElemTesting
Функционал: Проверка работы клика
  
  Сценарий: взаимодействие с чекбокс
    И открыть ссылку '${{url.form}}'
    И перейти на страницу 'Тестовая Форма'
    И установить фокус на элемент 'Чекбокс 1'
    И нажать на элемент 'Чекбокс 1'
    И выбрать в элементе 'Чекбокс 1' значение 'true'
    И проверить заполнение поля 'Чекбокс 1' значением 'true'
    И выбрать в элементе 'Чекбокс 1' значение 'false'
    И проверить заполнение поля 'Чекбокс 1' значением 'false'
    И нажать на элемент 'Чекбокс 1'
    И проверить заполнение поля 'Чекбокс 1' значением 'true'
  
  Сценарий: проверка клика по тексту
    И открыть ссылку '${{url.buttons}}'
    И перейти на страницу 'Форма с кнопками'
    Тогда нажать на элемент с текстом 'OnClick'
    И проверить заполнение поля 'OnClickStatus' значением 'Event Triggered'

  Сценарий: нажатие на кнопку требующую фокуса
    И открыть ссылку '${{url.buttons}}'
    И перейти на страницу 'Форма с кнопками'
    И установить фокус на элемент 'OnFocus'
    И нажать на элемент 'OnFocus'
    И проверить заполнение поля 'OnFocusStatus' значением 'Event Triggered'

  Сценарий: нажатие на кнопку с помощью js
    И открыть ссылку '${{url.buttons}}'
    И перейти на страницу 'Форма с кнопками'
    И нажать на элемент 'OnClick' используя javascript
    И проверить заполнение поля 'OnClickStatus' значением 'Event Triggered'
  @Skip
  Сценарий: нажатие правой кнопкой мыши
    И открыть ссылку '${{url.buttons}}'
    И перейти на страницу 'Форма с кнопками'
    И нажать на элемент 'OnContextMenu' правой кнопкой мыши
    И проверить заполнение поля 'OnContextMenuStatus' значением 'Event Triggered'
    