#language:ru
@displayed
@webElemTesting
Функционал: проверка отображения элементов
  
  Сценарий: проверка видимости элементов
    И открыть ссылку '${{url.form}}'
    И перейти на страницу 'Тестовая Форма'
    И отображается элемент 'Отправка'
    И элементы отображаются :
      | Отправка    |
      | Комментарий |
      | Логин       |
    
    И не отображается элемент 'Отсутствующий элемент'
    И элементы не отображаются :
      | Отсутствующий элемент |

  Сценарий: проверка исчезновения элемента по тексту
    И открыть ссылку '${{url.progressBars}}'
    И перейти на страницу 'Progress Bars'
    И отображается элемент 'Stop'
    И не отображается элемент 'Run'
    И нажать на элемент 'Start'
    И подождать 10 секунд, пока не исчезнет элемент с текстом 'Stop'
    И отображается элемент 'Run'
    И подождать 10 секунд, пока не исчезнет элемент с текстом 'Running'
    И отображается элемент 'Stop'
    И не отображается элемент 'Run'

  Сценарий: проверка исчезновения элемента по имени
    И открыть ссылку '${{url.progressBars}}'
    И перейти на страницу 'Progress Bars'
    И отображается элемент 'Stop'
    И не отображается элемент 'Run'
    И нажать на элемент 'Start'
    И подождать 10 секунд, пока не исчезнет элемент с текстом 'Stop'
    И отображается элемент 'Run'
    И подождать 10 секунд, пока не исчезнет элемент 'Run'
    И отображается элемент 'Stop'
    И не отображается элемент 'Run'