#language:ru
@input_fields_testing
@webElemTesting
Функционал: проверка ввода текста
  
  Сценарий: заполнение полей
    И открыть ссылку '${{url.form}}'
    И перейти на страницу 'Тестовая Форма'
    И установить переменные:
      | firstName | ${{fakerRu:Name.first_name}} |
      | comment  | ${{fakerRu:ogrn}}  |
    И заполнить поля значениями:
      | Логин        | ${{firstName}} |
      | Комментарий  | ${{comment}}  |
      | Поле-обертка | Иванович       |
    И проверить заполнение полей:
      | Логин        | ${{firstName}} |
      | Комментарий  | ${{comment}}  |
      | Поле-обертка | Иванович       |
  
  @clear_fields
  Сценарий: очистка заполненных полей
    И открыть ссылку '${{url.form}}'
    И перейти на страницу 'Тестовая Форма'
    И заполнить поля значениями:
      | Логин        | Иванов   |
      | Комментарий  | Иван     |
      | Поле-обертка | Иванович |
    И проверить заполнение полей:
      | Логин        | Иванов   |
      | Комментарий  | Иван     |
      | Поле-обертка | Иванович |
    И очистить поля:
      | Логин        |
      | Комментарий  |
      | Поле-обертка |
    И проверить заполнение полей:
      | Логин        |  |
      | Комментарий  |  |
      | Поле-обертка |  |
    И заполнить поля значениями:
      | Логин        | Иванов   |
      | Комментарий  | Иван     |
      | Поле-обертка | Иванович |
    И проверить заполнение полей:
      | Логин        | Иванов   |
      | Комментарий  | Иван     |
      | Поле-обертка | Иванович |
    И очистить поле 'Логин'
    И очистить поле 'Комментарий'
    И очистить поле 'Поле-обертка'
    И проверить заполнение полей:
      | Логин        |  |
      | Комментарий  |  |
      | Поле-обертка |  |
  
  Сценарий: повторное заполнение полей
    И открыть ссылку '${{url.form}}'
    И перейти на страницу 'Тестовая Форма'
    И заполнить поля значениями:
      | Логин        | Иванов   |
      | Комментарий  | Иван     |
      | Поле-обертка | Иванович |
    И заполнить поля значениями:
      | Логин       | Петров |
      | Комментарий | Петр   |
    И проверить заполнение полей:
      | Логин        | Петров   |
      | Комментарий  | Петр     |
      | Поле-обертка | Иванович |
  
  Сценарий: повторное заполнение поля
    И открыть ссылку '${{url.form}}'
    И установить ожидание 2 секунды
    И перейти на страницу 'Тестовая Форма'
    И заполнить поле 'Логин' значением 'Иванов'
    И заполнить поле 'Логин' значением 'Кукуев'
    И проверить вхождение в поле 'Логин' значений 'Кукуев'
  
  Сценарий: заполнения текстового поля обернутого в div
    И открыть ссылку '${{url.form}}'
    И перейти на страницу 'Тестовая Форма'
    И заполнить поле 'Поле-обертка' значением 'test'
    Тогда проверить заполнение поля 'Поле-обертка' значением 'test'
  
  Сценарий: ввод текста с клавиатуры
    И открыть ссылку '${{url.form}}'
    И перейти на страницу 'Тестовая Форма'
    И нажать на элемент 'Логин'
    Когда ввести с клавиатуры 'петр'
    И ввести с клавиатуры 'SEMICOLON'
    И ввести с клавиатуры 'Иванов'
    Тогда проверить заполнение полей:
      | Логин | петр;Иванов |
  
  Сценарий: ввод действий с клавиатуры
    И открыть ссылку '${{url.form}}'
    И перейти на страницу 'Тестовая Форма'
    И нажать на элемент 'Логин'
    И ввести с клавиатуры 'Иванов'
    И проверить заполнение полей:
      | Логин | Иванов |
    Когда ввести с клавиатуры 'CONTROL+A'
    И ввести с клавиатуры 'DELETE'
    И проверить заполнение полей:
      | Логин | ${{empty}} |
    И ввести с клавиатуры 'SPACE'
    Тогда проверить заполнение полей:
      | Логин | ${{empty}} ${{empty}} |