#language:ru
@list_testing
@webElemTesting
Функция: Проверка работы листов элементов
  
  Сценарий: клик по 1 пункту меню из списка Web элементов
    И открыть ссылку '${{url.buttons}}'
    И перейти на страницу 'Форма с кнопками'
    И нажать на элемент 2 из списка 'Кнопки WebElement'
    И проверить заполнение поля 2 из списка 'Статусы' значением 'Event Triggered'
  
  Сценарий: клик по 1 пункту меню из списка I элементов
    И открыть ссылку '${{url.buttons}}'
    И перейти на страницу 'Форма с кнопками'
    И нажать на элемент 2 из списка 'Кнопки IElement'
    И проверить заполнение поля 2 из списка 'Статусы' значением 'Event Triggered'
  
  Сценарий: клик по 1 пункту меню из списка
    И открыть ссылку '${{url.buttons}}'
    И перейти на страницу 'Форма с кнопками'
    И установить ожидание 1 секунду
    И нажать на элемент 2 из списка 'Кнопки'
    И проверить заполнение поля 2 из списка 'Статусы' значением 'Event Triggered'
  
  Сценарий: заполняем 1 элемент из списка с реализацией интерфейса
    И открыть ссылку '${{url.form}}'
    И перейти на страницу 'Тестовая Форма'
    И заполнить поле 2 из списка 'Поля списка' значением '100000'
  
  Сценарий: проверка кол-ва элементов в списке
    И открыть ссылку '${{url.buttons}}'
    И перейти на страницу 'Форма с кнопками'
    И количество элементов в списке 'Кнопки' соответствует 11
  
  Сценарий: проверка вхождения значений в элементы в списке полей
    И открыть ссылку '${{url.form}}'
    И перейти на страницу 'Тестовая Форма'
    И проверить вхождение значений в список 'Поля списка':
      | value 1 |
      | value 3 |
    И проверить, что список 'Поля списка' содержит все элементы таблицы:
      | value 1 |
      | value 2 |
      | value 3 |
  
  Сценарий: проверка вхождения значений в элементы в списке Кнопок
    И открыть ссылку '${{url.buttons}}'
    И перейти на страницу 'Форма с кнопками'
    И проверить вхождение значений в список 'Кнопки':
      | OnBlur        |
      | OnContextMenu |
      | OnFocus       |
      | OnKeyDown     |
      | OnKeyPress    |
      | OnMouseOver   |
      | OnMouseDown   |
    И проверить, что список 'Кнопки' содержит все элементы таблицы:
      | OnBlur        |
      | OnClick       |
      | OnContextMenu |
      | OnDoubleClick |
      | OnFocus       |
      | OnKeyDown     |
      | OnKeyUp       |
      | OnKeyPress    |
      | OnMouseOver   |
      | OnMouseLeave  |
      | OnMouseDown   |