#language:ru
@read_fields_testing
@webElemTesting
Функционал: проверка сохранения текста с элементов
  
  Сценарий: Сохранение значений с readOnly элемента
    И открыть ссылку '${{url.form}}'
    И перейти на страницу 'Тестовая Форма'
    И сохранить в переменные значения полей:
      | headerText | Заголовок |
    И сохранить в переменную 'headerText2' значение поля 'Заголовок'
    И переменные имеют значения:
      | headerText | == | Basic HTML Form Example |
      | headerText | == | ${{headerText2}}        |
  
  Сценарий: Сохранение значений с Input полей
    И открыть ссылку '${{url.form}}'
    И перейти на страницу 'Тестовая Форма'
    И заполнить поля значениями:
      | Логин       | Иванов |
      | Комментарий | текст  |
    
    И сохранить в переменные значения полей:
      | login   | Логин       |
      | comment | Комментарий |
    И переменные имеют значения:
      | login   | == | Иванов |
      | comment | == | текст  |
