#language:ru
@OrmTesting
@SaveContext
Функционал: тест hibernate

  Сценарий: добавление объекта
    И создать базу
    И создать тестовый объект
    И добавить в базу данных объект 'test'

  Сценарий: обновление объекта
    И обновить в базе данных объект 'test'

  Сценарий: удаление объекта
    И удалить из базы данных объект 'test'

  Сценарий: получить все записи
    И получить все объекты 'TestObject' из базы данных в переменную 'test'

  Сценарий: получить по id
    И получить объект 'TestObject' по идентификатору 2 в переменную 'test1'

  Сценарий: получить запись по name
    И получить объекты 'TestObject' в переменную 'test3' где:
      | name | like | Hello |