#language:ru
@desktopTesting
@Skip
Функция: Проверка работы десктопа
  
  Сценарий: тестовый сценарий
    И перейти на страницу 'Другая'
    И не отображается элемент 'check lazy'
    И очистить поле 'Text'
    И нажать на элемент 'Text' правой кнопкой мыши
    И нажать на элемент с текстом 'File'
    И нажать на элемент с текстом 'New'
    И нажать на элемент с текстом 'File'
    И нажать на элемент с текстом 'New'
    И нажать на элемент 'Close all'
    И нажать на элемент 'New'
    И нажать на элемент 'New'
    И нажать на элемент 'Close all'
    И установить переменную 'typed' = 'This is how desktop automation works LUL'
    И заполнить поле 'Text' значением '${{typed}}'
    И проверить заполнение поля 'Text' значением '${{typed}}'
    И очистить поле 'Text'
    И проверить заполнение поля 'Text' значением ''
    И проверить, что элемент 'Exit' активен
    И отображается элемент 'Text'
    И нажать на элемент 'Exit'

  Сценарий: проверка поиска по тексту
    И перейти на страницу 'Другая'
    И очистить поле 'Text'
    И установить переменную 'typed' = 'This is how desktop automation works LUL'
    И заполнить поле 'Text' значением 'This is how desktop automation works LUL'
    И проверить, что текст '${{typed}}' отображается
    И проверить, что текст 'LUL' отображается
    И проверить, что текст 'Web automation works LULT' не отображается
    И проверить многострочный текст:
    """
    ${{typed}}
    """
    И очистить поле 'Text'
    И нажать на элемент 'Exit'

  Сценарий: Проверка работы со скриншотами
    И перейти на страницу 'Другая'
    И очистить поле 'Text'
    И записать в файл 'src/test/resources/1.png' скриншот текущего окна
    И нажать на элемент с текстом 'File'
    И нажать на элемент с текстом 'New'
    И нажать на элемент с текстом 'File'
    И нажать на элемент с текстом 'New'
    И записать в файл 'src/test/resources/2.png' скриншот текущего окна
    И записать в файл 'src/test/resources/result.png' сравнение текущего окна со скриншотом 'src/test/resources/1.png'
    И записать в файл 'src/test/resources/result1.png' сравнение скриншотов 'src/test/resources/1.png' 'src/test/resources/2.png'
    И проверить, что существует файл 'file:result.png'
    И проверить, что существует файл 'file:result1.png'
    И удалить файл по пути 'src/test/resources/1.png'
    И удалить файл по пути 'src/test/resources/2.png'
    И удалить файл по пути 'src/test/resources/result.png'
    И удалить файл по пути 'src/test/resources/result1.png'
    И нажать на элемент 'Close all'
    И нажать на элемент 'Exit'

  Сценарий: наличие атрибута
    И перейти на страницу 'Другая'
    И проверить у элемента 'Exit' наличие атрибута 'Name'
    И нажать на элемент 'Exit'

  Сценарий: проверка атрибутов
    И перейти на страницу 'Другая'
    И проверить у элемента 'Exit' значения атрибутов:
      | Name | != | name    |
      | Name | == | Закрыть |
    И нажать на элемент 'Exit'

  Сценарий: исчезновение элемента
    И перейти на страницу 'Другая'
    И подождать 5 секунд, пока не исчезнет элемент 'New_2'
    И нажать на элемент 'Exit'