#language:ru
@alerts
@browser
@webElemTesting
Функция: Проверка работы с всплывающими окнами
  
  Сценарий: отклонение алерта
    Дано открыть ссылку '${{url.alerts}}'
    И установить переменные:
      | response | You clicked Cancel. 'prompt' returned null |
    И перейти на страницу 'Предупреждения'
    Когда нажать на элемент 'Show prompt'
    И выбрать в открывшемся поп-апе Отменить
    Тогда проверить заполнение поля 'Ответ' значением '${{response}}'
  
  Сценарий: проверка работы ввода в поп-ап
    Дано установить переменную 'entered' = '${{fakerRu:Name.first_name}}'
    И установить переменные:
      | response | You clicked OK. 'prompt' returned ${{entered}} |
    И открыть ссылку '${{url.alerts}}'
    И перейти на страницу 'Предупреждения'
    Когда нажать на элемент 'Show prompt'
    И ввести в окне поп-апа '${{entered}}'
    И выбрать в открывшемся поп-апе Подтвердить
    Тогда проверить заполнение поля 'Ответ' значением '${{response}}'
  
  Сценарий: проверка чтения с поп-апа
    Дано открыть ссылку '${{url.alerts}}'
    И перейти на страницу 'Предупреждения'
    Когда нажать на элемент 'Show prompt'
    Тогда проверить, что текст поп-апа contains 'I prompt you'
    И проверить, что текст поп-апа !contains 'I kill you'
    И выбрать в открывшемся поп-апе Отменить