#language:ru
@webElemTesting
@browser
@open_url_testing
Функционал: проверка перехода по URL
  
  Сценарий: открывается страница по умолчанию указанная в проперти
    И перейти на страницу 'Тестовая Форма'
  
  Сценарий: переход по URL
    И открыть ссылку 'file://${{user.dir}}/src/test/resources/local_pages/form.html'
    И перейти на страницу 'Тестовая Форма'
    И проверить, что элемент 'Отправка' активен
  
  Сценарий: переход по URL из переменной
    И открыть ссылку '${{url.form}}'
    И перейти на страницу 'Тестовая Форма'
    И проверить, что элемент 'Отправка' активен
  
  Сценарий: переход на страницу
    И открыть страницу 'Тестовая Форма'
    И проверить, что элемент 'Отправка' активен

  Сценарий: проверка адреса URL страницы
    И открыть ссылку '${{url.form}}'
    И перейти на страницу 'Тестовая Форма'
    И проверить, что URL страницы != 'https://yandex.ru/'
    И открыть страницу 'Тестовая Форма'
    И проверить, что URL страницы != 'https://mail.ru/'
    И проверить, что URL страницы contains 'form.html'
    И проверить, что URL страницы !contains 'fromm'
    И проверить, что URL страницы notBlank ''
    И проверить, что URL страницы notNull ''
    И проверить, что URL страницы matchesRegex '[a-z]{2,}\:(.)*([a-zA-Z]\/)+([a-zA-Z0-9]+\.[a-zA-Z0-9]+)?'

  Сценарий: проверка заголовка страницы
    И открыть ссылку '${{url.form}}'
    И перейти на страницу 'Тестовая Форма'
    И проверить, что заголовок страницы == 'HTML Form Elements'
    И проверить, что заголовок страницы != 'some web page'
    И проверить, что заголовок страницы contains 'Form Elements'
    И проверить, что заголовок страницы !contains 'From'
    И проверить, что заголовок страницы notBlank ''
    И проверить, что заголовок страницы notNull ''
    И проверить, что заголовок страницы matchesRegex '^[A-Za-zа-яА-ЯёЁ0-9\s,.!?:\'"()-]*$'
