#language:ru
@scroll
@browser
@webElemTesting
Функционал: проверка работы прокрутки страницы
  
  Сценарий: скролл вниз и вверх по странице
    И открыть ссылку '${{url.buttons}}'
    И перейти на страницу 'Форма с кнопками'
    И прокрутить ScrollBar вниз на 200 пикселей
    И элементы отображаются :
      | OnMouseOver |
    И прокрутить ScrollBar вниз до конца страницы
    И элементы отображаются :
      | OnMouseDown |
    И прокрутить ScrollBar вверх на 200 пикселей
    И элементы отображаются :
      | OnFocus |
    И прокрутить ScrollBar вверх до начала страницы
    И элементы отображаются :
      | OnBlur |
    И прокрутить ScrollBar до появления элемента с текстом 'OnMouseDown'
    И элементы отображаются :
      | OnMouseDown |
    И прокрутить ScrollBar вверх до начала страницы
    И прокрутить ScrollBar до появления элемента 'OnMouseDown'
    И элементы отображаются :
      | OnMouseDown |
