#language:ru
@tabs
@browser
@webElemTesting
Функционал: работа с вкладками браузера
  @UI
  Сценарий: проверка обновления страницы
    И открыть ссылку '${{url.form}}'
    И перейти на страницу 'Тестовая Форма'
    И заполнить поле 'Логин' значением 'тест'
    И обновить текущую страницу
    И проверить заполнение поля 'Логин' значением ''

  Сценарий: проверка перехода назад и вперёд в браузере
    И открыть ссылку '${{url.form}}'
    И перейти на страницу 'Тестовая Форма'
    И открыть ссылку '${{url.tablePage}}'
    И перейти на страницу 'Dynamic HTML TABLE e2e'
    И вернуться в браузере на страницу назад
    И проверить, что URL страницы contains 'form.html'
    И вернуться в браузере на страницу вперёд
    И проверить, что URL страницы contains 'tablePage.html'

  Сценарий: проверка открытия новой вкладки
    И открыть ссылку '${{url.form}}'
    И открыть в браузере новую вкладку
    И открыть ссылку '${{url.tablePage}}'
    И перейти на страницу 'Dynamic HTML TABLE e2e'
    И проверить, что URL страницы contains 'tablePage.html'
    И закрыть текущую вкладку
    И переключиться на вкладку 1
    И проверить, что URL страницы contains 'form.html'

  Сценарий: проверка переключения между вкладками
    И открыть ссылку '${{url.form}}'
    И открыть в браузере новую вкладку
    И открыть ссылку '${{url.tablePage}}'
    И переключиться на вкладку 1
    И проверить, что URL страницы contains 'form.html'
    И переключиться на вкладку 2
    И проверить, что URL страницы contains 'tablePage.html'
    И закрыть текущую вкладку
    И переключиться на вкладку 1
    И проверить, что URL страницы contains 'form.html'