#language:ru
@javaTesting
Функционал: проверка работы java driver

  Сценарий: авторизация в системе
    И перейти на страницу 'Login'
    И проверить, что элемент 'Login' не активен
    И нажать на элемент 'Cancel' правой кнопкой мыши
    И нажать на элемент с текстом 'Test'
    И заполнить поле 'UserName' значением 'James'
    И заполнить поле 'Password' значением 'Bond'
    И проверить, что элемент 'Login' активен
    И проверить, что элемент 'UserName' доступен для редактирования
    И проверить, что элемент 'DisabledField' недоступен для редактирования
    И нажать на элемент 'Remember me'
    И нажать на элемент 'Login'
    И перейти на страницу 'Login Success'
    И проверить заполнение поля 'Label' значением 'You logged in as: James with password: Bond'
    И нажать на элемент с текстом 'OK'

  Сценарий: Проверка взаимодейсвтия клавиатурного шага
    И перейти на страницу 'Login'
    И нажать на элемент 'UserName'
    И ввести с клавиатуры 'James'
    И проверить заполнение поля 'UserName' значением 'James'
    И ввести с клавиатуры 'BACK_SPACE'
    И проверить заполнение поля 'UserName' значением 'Jame'
    И ввести с клавиатуры 'CONTROL+A'
    И ввести с клавиатуры 'DELETE'
    И проверить заполнение поля 'UserName' значением '${{empty}}'

  Сценарий: Проверка отображения текста
    И перейти на страницу 'Login'
    И заполнить поле 'UserName' значением 'James'
    И заполнить поле 'Password' значением 'Bond'
    И проверить, что текст 'James' отображается
    И проверить, что текст 'Jame' отображается
    И проверить, что текст 'Jon' не отображается
    И проверить многострочный текст:
    """
    Bond
    """

  Сценарий: Проверка работы со скриншотами
    И перейти на страницу 'Login'
    И записать в файл 'src/test/resources/1.png' скриншот текущего окна
    И заполнить поле 'UserName' значением 'James'
    И заполнить поле 'Password' значением 'Bond'
    И записать в файл 'src/test/resources/2.png' скриншот текущего окна
    И записать в файл 'src/test/resources/result.png' сравнение текущего окна со скриншотом 'src/test/resources/1.png'
    И записать в файл 'src/test/resources/result1.png' сравнение скриншотов 'src/test/resources/1.png' 'src/test/resources/2.png'
    И проверить, что существует файл 'file:result.png'
    И проверить, что существует файл 'file:result1.png'
    И удалить файл по пути 'src/test/resources/1.png'
    И удалить файл по пути 'src/test/resources/2.png'
    И удалить файл по пути 'src/test/resources/result.png'
    И удалить файл по пути 'src/test/resources/result1.png'

  Сценарий: наличие атрибута
    И перейти на страницу 'Login'
    И проверить у элемента 'Cancel' наличие атрибута 'name'

  Сценарий: проверка атрибутов
    И перейти на страницу 'Login'
    И проверить у элемента 'Cancel' значения атрибутов:
      | name | == | cancel |
      | name | != | name   |