#language:ru

@WiremockDemo
Функция: Сервер заглушек WireMock

  @WireMockTextStub
  Сценарий: Загрузка маппинга в сценарии
    #сервер запускается на порту 8484, но порт можно переопределить в framework-*.configuration
    Дано запустить сервер заглушек.
    И загрузить в заглушку маппинг:
    """
      {
        "request": {
          "method": "POST",
          "url": "/some/thing"
        },
        "response": {
          "status": 200,
          "body": "{\"content\": \"Hello world!\",\"amount\": 10000000.0300}",
          "headers": {
            "Content-Type": "text/json"
          }
        }
      }
    """
    И адрес сервера 'https://localhost:8484'
    И эндпоинт '/some/thing'
    И отправить POST запрос
    И статус ответа = 200
    И получить переменные из body:
      | amount | amount |
    И ответ содержит body:
      | content | ==                | "Hello world!"  |
      | amount  | ==                | ${{amount}}     |
      | amount  | bigDecimalEquals  | 10000000.03     |
      | amount  | bigDecimalEquals  | 10000000.030    |
      | amount  | bigDecimalEquals  | 10000000.03000  |
      | amount  | bigDecimalCloseTo | 10000000.030001 |

    И очистить в заглушке историю запросов
    И очистить в заглушке маппинги
    И остановить сервер заглушек.

  @WireMockFileLoad
  Сценарий: Загрузка маппинга через файл
    Дано запустить сервер заглушек
    И загрузить в заглушку маппинг 'data/demo/wiremock/mappings/test_get_this.json'
    И адрес сервера 'https://localhost:8484'
    И эндпоинт '/get/this'
    И отправить GET запрос
    И статус ответа = 200
    И ответ содержит body:
      | content | == | "test GET this" |
    И очистить в заглушке историю запросов
    И очистить в заглушке маппинги
    И остановить сервер заглушек.

  @WireMockMultipleFilesLoad
  Сценарий: Загрузка маппинга через файл и очистка
    Дано запустить сервер заглушек
    И загрузить в заглушку маппинги 'data/demo/wiremock/mappings/*.json'
    И адрес сервера 'https://localhost:8484'
    И эндпоинт '/get/this'
    И отправить GET запрос
    И статус ответа = 200
    И ответ содержит body:
      | content | == | "test GET this" |
    И эндпоинт '/get/that'
    И отправить GET запрос
    И статус ответа = 200
    И ответ содержит body:
      | content | == | "test GET that" |
    И очистить в заглушке историю запросов
    И очистить в заглушке маппинги
    И отправить GET запрос
    И статус ответа = 404
    И эндпоинт '/get/this'
    И отправить GET запрос
    И статус ответа = 404
    И остановить сервер заглушек.


  @WireMockCheckRequest
  Сценарий: Тестирование обработки запросов мок сервером
    Дано запустить сервер заглушек
    Когда адрес сервера 'https://localhost:8484/some/thing'
    И установить header'ы:
      | SOAPAction | test123 |
    И запрос содержит body:
    """
    test wire mock server
    """
    И отправить POST запрос
    Тогда проверить в заглушке запрос '/some/thing', отправленный методом POST

    И этот запрос содержит заголовки:
      | SOAPAction | test\d{3} |
    И этот запрос содержит в body строку:
    """
    test wire mock
    """
    И очистить в заглушке историю запросов
    И очистить в заглушке маппинги
    И остановить сервер заглушек.

#language:ru

  @WireMockTextStub
  Сценарий: Чтение xml
    #сервер запускается на порту 8484, но порт можно переопределить в framework-*.configuration
    Дано запустить сервер заглушек.
    И загрузить в заглушку маппинг:
    """
      {
        "request": {
          "method": "POST",
          "url": "/some/thing"
        },
        "response": {
          "status": 200,
          "body": "<?xml version=\"1.0\"?><note><to>Tove</to></note>",
          "headers": {
            "Content-Type": "text/xml"
          }
        }
      }
    """
    И адрес сервера 'https://localhost:8484'
    И эндпоинт '/some/thing'
    И отправить POST запрос
    И статус ответа = 200
    И получить переменные из body:
      | to | to |
    И переменные имеют значения:
      | to | == | Tove |
    И очистить в заглушке историю запросов
    И очистить в заглушке маппинги
    И остановить сервер заглушек.
    
  @WireMockTextStub
  Сценарий: Проверка опроса сервера с циклошагами
    #сервер запускается на порту 8484, но порт можно переопределить в framework-*.configuration
    Дано запустить сервер заглушек.
    И загрузить в заглушку маппинги 'data/demo/wiremock/mappings/scenario1/*.json'
    И адрес сервера 'https://localhost:8484'
    И эндпоинт '/get'
    И начало цепочки шагов с 3 попытками с интервалом 200 мс
    И отправить GET запрос
    И статус ответа = 200
    И получить переменные из body:
      | responseText | content |
    И переменные имеют значения:
      | responseText  | == | Hello world! |
    И конец цепочки шагов
    И очистить в заглушке историю запросов
    И очистить в заглушке маппинги
    И остановить сервер заглушек.


  @WireMockTextStub
  Сценарий: Валидация plain/text
    #сервер запускается на порту 8484, но порт можно переопределить в framework-*.configuration
    Дано запустить сервер заглушек.
    И установить переменные:
     |expected| 2123 |
    И загрузить в заглушку маппинг:
    """
      {
        "request": {
          "method": "POST",
          "url": "/some/thing"
        },
        "response": {
          "status": 200,
          "body": 2123,
          "headers": {
            "Content-Type": "text/plain"
          }
        }
      }
    """
    И адрес сервера 'https://localhost:8484'
    И эндпоинт '/some/thing'
    И отправить POST запрос
    И тело ответа == '2123'
    И тело ответа == '${{expected}}'
    И тело ответа != '212'
    И тело ответа contains '2'
    И тело ответа matchesRegex '^\d+$'
    И очистить в заглушке историю запросов
    И очистить в заглушке маппинги
    И остановить сервер заглушек.